#Задание 1
#date = input('Введите дату: ')
#task = input('Введите задачу: ')
#print(date, task)

#Задание 2
#dates = []
#tasks = []
#i = 0
#j = 0
#while i < 3:
#    date = input('Введите дату: ')
#    task = input('Введите задачу: ')
#    dates.append(date)
#    tasks.append(task)
#    i += 1
#while j < 3:
#    print(dates[j], tasks[j])
#    j += 1

#Задание 3
todolist = {}
i = 0
while i < 3:
    date = input('Введите дату: ')
    task = input('Введите задачу: ')
    todolist[date] = task
    i += 1
